**Алгоритм: Вычисление таблицы значений функции**

Алгоритм вычисляет значения кусочной функции f(x) на заданном диапазоне значений x с заданным шагом.

1. **Входные данные:**
    
    - `start_x`: Начальное значение x в интервале. (double)
    - `end_x`: Конечное значение x в интервале. (double)
    - `step`: Увеличение, на которое x увеличивается в каждой итерации. (double)
    - `f(x)`: Кусочная функция, определенная следующим образом:
        - Если x > 0, f(x) = x^(3/5) (что эквивалентно 5-му корню из x в кубе)
        - Если x <= 0, f(x) = x^2 + Σ(от k=1 до 3) [x^k / k]
2. **Инициализация:**
    
    - `x = start_x`: Инициализировать переменную x начальным значением.
    - Вывести заголовок для таблицы вывода (например, "x\tf(x)").
3. **Итерация:**
    
    - Пока x меньше или равно `end_x`: Этот цикл продолжается, пока x находится в заданном диапазоне.
    - Вычислить `result = f(x)`: Вызвать функцию f(x) с текущим значением x, чтобы получить значение функции.
    - Вывести текущие значения x и result в формате строки таблицы: Использовать `cout` (или аналогичный механизм вывода) для отображения x и result с соответствующими отступами и форматированием. Установить точность вывода на фиксированное количество знаков после запятой (например, 4 знака после запятой).
    - Увеличить x: Увеличить x на размер шага: `x = x + step`.
4. **Вычисление функции f(x):**
    
    - Если x > 0:
        - Вычислить f(x) как `pow(x, 3.0/5.0)`.
        - Вернуть вычисленное значение.
    - Иначе (если x <= 0):
        - Инициализировать `sum_term = 0.0`. Эта переменная будет хранить сумму ряда.
        - Для k от 1 до 3 (включительно): Этот цикл вычисляет каждый член в суммировании.
            - Вычислить текущий член: `term = pow(x, k) / k`.
            - Добавить текущий член к текущей сумме: `sum_term = sum_term + term`.
        - Вычислить f(x) как `pow(x, 2) + sum_term`.
        - Вернуть вычисленное значение.
5. **Завершение:**
    
    - Цикл while завершается, когда x становится больше `end_x`. Программа завершает свою работу.
`
`#include <iostream>`
`#include <cmath>`
`#include <iomanip>`
`using namespace std;`
`double f(double x) {`
    `if (x > 0) {`
        `return pow(x, 3.0/5.0);` 
    `} else {`
        `double sum_term = 0.0;`
        `for (int k = 1; k <= 3; ++k) {`
            `sum_term += pow(x, k) / k;`
        `}`
        `return pow(x, 2) + sum_term;`
    `}`
`}`
`int main() {`
    `double start_x = -2.0;`
    `double end_x = 2.0;`
    `double step = 0.4;`
    `cout << "x\tf(x)" << endl;`
    `cout << fixed << setprecision(4);`
    `double x = start_x;`
    `while (x <= end_x) {`
        `double result = f(x);`
        `cout << setw(5) << x << "\t" << result << endl; // Use setw for formatting x`
        `x += step;`
    `}`

    `return 0;`
`}`

Результат:
x      f(x)
-2.0	0.6667
-1.6	0.6656
-1.2	0.8187
-0.8	0.8717
-0.4	0.7243
0.0	0.0000
0.4	0.6931
0.8	0.7878
1.2	0.8625
1.6	0.9251
2.0	0.9777


### Алгоритм: Вычисление корней квадратного уравнения

1. **Входные данные:**
   - `a`: Коэффициент при \( x^2 \) (double).
   - `b`: Коэффициент при \( x \) (double).
   - `c`: Свободный член (double).

2. **Инициализация:**
   - Запросить у пользователя ввод значений `a`, `b` и `c`.
   - Проверить, что `a` не равно нулю.

3. **Проверка коэффициента `a`:**
   - Если `a` равно 0:
     - Вывести сообщение об ошибке: "Коэффициент 'a' не должен быть равен нулю."
     - Завершить программу.

4. **Вычисление дискриминанта:**
   - Вычислить дискриминант: `discriminant = b^2 - 4ac`.

5. **Проверка дискриминанта:**
   - Если `discriminant < 0`:
     - Вывести сообщение: "Нет действительных корней."
   - Иначе (если `discriminant >= 0`):
     - Вычислить корни:
       - `y1 = (-b + sqrt(discriminant)) / (2 * a)` (первый корень).
       - `y2 = (-b - sqrt(discriminant)) / (2 * a)` (второй корень).
     - Вывести корни: "Корни: y1 = [значение], y2 = [значение]".

6. **Завершение:**
   - Программа завершает свою работу.

- **Условное выполнение**: Использование операторов if и else для проверки условий (например, значение `a` и дискриминант).
- **Вычисление дискриминанта**: Формула для вычисления дискриминанта квадратного уравнения.
- **Функция `sqrt`**: Использование стандартной библиотеки для вычисления квадратного корня.
- **Вывод информации**: Использование `cout` для отображения результатов пользователю.
```
#include <math.h>
#include <iostream>
using namespace std;

int main()
{
    double a, b, c, y1, y2; // Изменено на double для более точных вычислений
    cout << "Type a number (a, b, c): ";
    cin >> a >> b >> c;

    if (a != 0)
    {
        double discriminant = pow(b, 2) - (4 * a * c);
        
        if (discriminant < 0)
        {
            cout << "No real roots." << endl;
        }
        else
        {
            y1 = (-b + sqrt(discriminant)) / (2 * a);
            y2 = (-b - sqrt(discriminant)) / (2 * a);
            cout << "Roots: y1 = " << y1 << ", y2 = " << y2 << endl;
        }
    }
    else
    {
        cout << "Coefficient 'a' must not be zero." << endl;
    }

    return 0; // Завершение программы
}
```

